app/views/proposals/show.html.erb

SELECT "milestones".* FROM "milestones" WHERE "milestones"."proposal_id" = ?  [["proposal_id", 3]]
---
Milestones:<br>
<% @proposal.milestones.each.with_index(1) do |milestone, i| %>

SELECT "fees".* FROM "fees" WHERE "fees"."proposal_id" = ?  [["proposal_id", 3]]
---
Fees:<br>
<% @proposal.fees.each.with_index(1) do |fee, i| %>