app/controllers/pages_controller.rb

  def companydash
    @email = current_user.email
    @id = current_user.id
    @proposals = Proposal.where(:email => @email)
---
SELECT "proposals".* FROM "proposals" WHERE "proposals"."email" = ?  [["email", "braydonwhitmarsh@me.com"]]