app/controllers/proposals_controller.rb

  def create
    if any_blanks?
    else
      if User.find_by(:email => params[:proposal][:email])
        @user = User.find_by(:email => params[:proposal][:email])
        if current_admin.users.include?(@user)
          @user = current_admin.users.find_by(:email => params[:proposal][:email])

          if @user.proposals.create(proposal_params).valid?
            @proposal = @user.proposals.create(proposal_params)
          else
            flash[:notice] = "Invalid Proposal."
            redirect_to :back
          end
        else
          @user.admin = current_admin
          current_admin.users << @user
          @proposal = @user.proposals.create(proposal_params)
          @proposal.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "braydonwhitmarsh@me.com"]]
SELECT  "users".* FROM "users" WHERE "users"."admin_id" = ? AND "users"."email" = ? LIMIT 1  [["admin_id", 1], ["email", "braydonw@me.com"]]
SELECT  1 AS one FROM "users" WHERE "users"."admin_id" = ? AND "users"."id" = ? LIMIT 1  [["admin_id", 1], ["id", 1]]
SELECT "proposals".* FROM "proposals" INNER JOIN "users" ON "proposals"."user_id" = "users"."id" WHERE "users"."admin_id" = ?  [["admin_id", 1]]
INSERT INTO "proposals" ("email", "title", "budget", "why_me", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", "dkjsfabsASD"], ["title", "JBKQS"], ["budget", 87], ["why_me", 8], ["created_at", "2017-12-13 08:43:12.389517"], ["updated_at", "2017-12-13 08:43:12.389517"]]
INSERT INTO "users" ("email", "encrypted_password", "admin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
UPDATE "users" SET "admin_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin_id", 1], ["updated_at", "2017-12-13 11:37:33.510351"], ["id", 1]]

  def show
    @proposal = Proposal.find(params[:id])
---
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = ? LIMIT 1  [["id", 3]]

  def destroy
    @proposal = Proposal.find_by(:id => params[:id])
    @proposal.destroy
---
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "proposals" WHERE "proposals"."id" = ?  [["id", 1]]